Revit 2026 API

# ImageTypeOptionsPageNumber Property

---

The page in the file to be used for the image

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int PageNumber { get; set; }
```
```vb
Public Property PageNumber As Integer
	Get
	Set
```
```cpp
public:
property int PageNumber {
	int get ();
	void set (int value);
}
```
```fsharp
member PageNumber : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for pageNumber is not positive. |

The default value of this property is 1. This default is appropriate for most file types. This should be used for files, such as PDF files, that can have multiple pages. Valid values range from 1 to the number of pages in the file.

#### Reference

ImageTypeOptions Class

Autodesk.Revit.DB Namespace